### Week 6 Python In Class Assignment

Part 1:
1. Load your dataset
2. Only return 3 specific columns (of your choice
3. Using iloc to Only return  column from start to the 5th column
4. Use iloc to only return top 7 rows and the 3rd, 4th, and 7th columns

In [1]:
import seaborn as sns
import pandas as pd

In [2]:
penguins = sns.load_dataset('penguins')

In [3]:
penguins.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female

In [4]:
penguins.loc[:5,['species','body_mass_g','sex']]

  species  body_mass_g     sex
0  Adelie       3750.0    Male
1  Adelie       3800.0  Female
2  Adelie       3250.0  Female
3  Adelie          NaN     NaN
4  Adelie       3450.0  Female
5  Adelie       3650.0    Male

In [5]:
penguins.iloc[:5,:5]

  species     island  bill_length_mm  bill_depth_mm  flipper_length_mm
0  Adelie  Torgersen            39.1           18.7              181.0
1  Adelie  Torgersen            39.5           17.4              186.0
2  Adelie  Torgersen            40.3           18.0              195.0
3  Adelie  Torgersen             NaN            NaN                NaN
4  Adelie  Torgersen            36.7           19.3              193.0

In [6]:
# There is no column with index 7, so using index 6
penguins.iloc[:7,[3,4,6]]

   bill_depth_mm  flipper_length_mm     sex
0           18.7              181.0    Male
1           17.4              186.0  Female
2           18.0              195.0  Female
3            NaN                NaN     NaN
4           19.3              193.0  Female
5           20.6              190.0    Male
6           17.8              181.0  Female

### Part 2:
1. demonstrate 1 filter with 1 condition on your dataset
2. demonstrate a filter with 2 conditions on your dataset 
3. Use the loc function to only return 1 specific column

In [9]:
penguins['species'].unique()

array(['Adelie', 'Chinstrap', 'Gentoo'], dtype=object)

In [15]:
penguins.describe()

       bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g
count      342.000000     342.000000         342.000000   342.000000
mean        43.921930      17.151170         200.915205  4201.754386
std          5.459584       1.974793          14.061714   801.954536
min         32.100000      13.100000         172.000000  2700.000000
25%         39.225000      15.600000         190.000000  3550.000000
50%         44.450000      17.300000         197.000000  4050.000000
75%         48.500000      18.700000         213.000000  4750.000000
max         59.600000      21.500000         231.000000  6300.000000

In [11]:
penguins.loc[(penguins['species']=='Adelie')]

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female
...,...,...,...,...,...,...,...
147,Adelie,Dream,36.6,18.4,184.0,3475.0,Female
148,Adelie,Dream,36.0,17.8,195.0,3450.0,Female
149,Adelie,Dream,37.8,18.1,193.0,3750.0,Male
150,Adelie,Dream,36.0,17.1,187.0,3700.0,Female
151,Adelie,Dream,41.5,18.5,201.0,4000.0,Male

In [16]:
#Penguins above average weight and average flipper length using value_counts() to count the no. of Males 
penguins.loc[(penguins['body_mass_g']>=4200)&(penguins['flipper_length_mm']>=200),'sex'].value_counts()['Male']

70

In [17]:
#Penguins above average weight and average flipper length using value_counts() to count the no. of Females
penguins.loc[(penguins['body_mass_g']>=4200)&(penguins['flipper_length_mm']>=200),'sex'].value_counts()['Female']

56